#include "header.h"

void TestHomework1()
{
    // 设人、狼、羊、菜在家则为T，在对岸则为F
    // 根据狼吃羊、羊吃草，TFFX、FTTX、TXFF、FXTT不存在
    // 则只需找到TTTT -> FFFF的最短路径
    //
    //          0    1    2    3    4    5    6    7    8    9
    //        TTTT TTTF TTFT TFTT TFTF FTFT FTFF FFTF FFFT FFFF
    //        -------------------------------------------------
    // 0 TTTT|                           1                     
    // 1 TTTF|                                1    1           
    // 2 TTFT|                           1    1         1      
    // 3 TFTT|                                     1    1      
    // 4 TFTF|                                     1         1 
    // 5 FTFT|  1         1                                    
    // 6 FTFF|       1    1                                    
    // 7 FFTF|       1         1    1                          
    // 8 FFFT|            1    1                               
    // 9 FFFF|                      1                          

    int matrix[10][10] = {
        {0, 0, 0, 0, 0, 1, 0, 0, 0, 0},
        {0, 0, 0, 0, 0, 0, 1, 1, 0, 0},
        {0, 0, 0, 0, 0, 1, 1, 0, 1, 0},
        {0, 0, 0, 0, 0, 0, 0, 1, 1, 0},
        {0, 0, 0, 0, 0, 0, 0, 1, 0, 1},
        {1, 0, 1, 0, 0, 0, 0, 0, 0, 0},
        {0, 1, 1, 0, 0, 0, 0, 0, 0, 0},
        {0, 1, 0, 1, 1, 0, 0, 0, 0, 0},
        {0, 0, 1, 1, 0, 0, 0, 0, 0, 0},
        {0, 0, 0, 0, 1, 0, 0, 0, 0, 0},
    };
    Graph* graph = InitGraph(matrix, 10);
    Dijkstra(graph, 0, 9);
}
